{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"libraryName":1,"itemPath":2,"docItem":3},"sveltejs-svelte","Runes/what-are-runes",{"type":4,"path":5,"relevant":6,"token_counts":7,"usage":11,"markdown":15},"page","02-runes/01-what-are-runes.md",true,{"fulltext":8,"digest":9,"short_digest":10},247,120,63,{"input":12,"output":13,"details":14},1290,307,null,{"fulltext":16,"digest":17,"short_digest":18,"essence":19},"---\ntitle: What are runes?\n---\n\n> [!NOTE] **rune** /ruːn/ _noun_\n>\n> A letter or mark used as a mystical or magic symbol.\n\nRunes are symbols that you use in `.svelte` and `.svelte.js`/`.svelte.ts` files to control the Svelte compiler. If you think of Svelte as a language, runes are part of the syntax — they are _keywords_.\n\nRunes have a `$` prefix and look like functions:\n\n```js\nlet message = $state('hello');\n```\n\nThey differ from normal JavaScript functions in important ways, however:\n\n- You don't need to import them — they are part of the language\n- They're not values — you can't assign them to a variable or pass them as arguments to a function\n- Just like JavaScript keywords, they are only valid in certain positions (the compiler will help you if you put them in the wrong place)\n\n> [!LEGACY]\n> Runes didn't exist prior to Svelte 5.\n","Runes are compiler-controlled symbols in Svelte that use a `$` prefix and look like functions. They are keywords in the Svelte language, not regular JavaScript functions.\n\nKey differences from normal functions:\n- No import needed — built into the language\n- Not assignable values — cannot be assigned to variables or passed as arguments\n- Valid only in specific positions — compiler validates placement\n\nExample:\n```js\nlet message = $state('hello');\n```\n\nRunes were introduced in Svelte 5.","Runes are `$`-prefixed compiler keywords in Svelte (e.g., `$state('hello')`) that control the compiler. Unlike functions, they cannot be imported, assigned, or passed as arguments, and are only valid in specific positions.","Runes are $ -prefixed keywords in Svelte that control the compiler and differ from regular functions in that they cannot be imported, assigned, or passed as arguments."],"uses":{"params":["name","path"]}}]}
