{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"libraryName":1,"itemPath":2,"docItem":3},"sveltejs-svelte","Legacy Mode/legacy-overview",{"type":4,"path":5,"relevant":6,"token_counts":7,"usage":11,"markdown":15},"page","99-legacy/00-legacy-overview.md",true,{"fulltext":8,"digest":9,"short_digest":10},264,130,64,{"input":12,"output":13,"details":14},1303,309,null,{"fulltext":16,"digest":17,"short_digest":18,"essence":19},"---\ntitle: Overview\n---\n\nSvelte 5 introduced some significant changes to Svelte's API, including [runes](what-are-runes), [snippets](snippet) and event attributes. As a result, some Svelte 3/4 features are deprecated (though supported for now, unless otherwise specified) and will eventually be removed. We recommend that you incrementally [migrate your existing code](v5-migration-guide).\n\nThe following pages document these features for\n\n- people still using Svelte 3/4\n- people using Svelte 5, but with components that haven't yet been migrated\n\nSince Svelte 3/4 syntax still works in Svelte 5, we will distinguish between _legacy mode_ and _runes mode_. Once a component is in runes mode (which you can opt into by using runes, or by explicitly setting the `runes: true` compiler option), legacy mode features are no longer available.\n\nIf you're exclusively interested in the Svelte 3/4 syntax, you can browse its documentation at [v4.svelte.dev](https://v4.svelte.dev).\n","Svelte 5 introduced runes, snippets, and event attributes, deprecating some Svelte 3/4 features. Legacy mode features are available in Svelte 5 until a component opts into runes mode (by using runes or setting `runes: true` compiler option). Once in runes mode, legacy features are no longer available. Svelte 3/4 syntax still works in Svelte 5 for backward compatibility. For Svelte 3/4 specific documentation, refer to v4.svelte.dev.","Svelte 5 deprecated Svelte 3/4 features in favor of runes and snippets. Legacy mode features work in Svelte 5 until a component opts into runes mode with `runes: true` or by using runes.","Overview of deprecated Svelte 3/4 features in Svelte 5 and how legacy mode works alongside runes mode."],"uses":{"params":["name","path"]}}]}
