{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"libraryName":1,"itemPath":2,"docItem":3},"sveltejs-sveltekit","best-practices/authentication-and-authorization",{"type":4,"path":5,"relevant":6,"token_counts":7,"usage":11,"markdown":15},"page","40-best-practices/03-auth.md",true,{"fulltext":8,"digest":9,"short_digest":10},456,179,71,{"input":12,"output":13,"details":14},1499,364,null,{"fulltext":16,"digest":17,"short_digest":18,"essence":19},"---\ntitle: Auth\n---\n\nAuth refers to authentication and authorization, which are common needs when building a web application. Authentication means verifying that the user is who they say they are based on their provided credentials. Authorization means determining which actions they are allowed to take.\n\n## Sessions vs tokens\n\nAfter the user has provided their credentials such as a username and password, we want to allow them to use the application without needing to provide their credentials again for future requests. Users are commonly authenticated on subsequent requests with either a session identifier or signed token such as a JSON Web Token (JWT).\n\nSession IDs are most commonly stored in a database. They can be immediately revoked, but require a database query to be made on each request.\n\nIn contrast, JWT generally are not checked against a datastore, which means they cannot be immediately revoked. The advantage of this method is improved latency and reduced load on your datastore.\n\n## Integration points\n\nAuth [cookies](@sveltejs-kit#Cookies) can be checked inside [server hooks](hooks#Server-hooks). If a user is found matching the provided credentials, the user information can be stored in [`locals`](hooks#Server-hooks-locals).\n\n## Guides\n\n[Lucia](https://lucia-auth.com/) is a good reference for session-based web app auth. It contains example code snippets and projects for implementing session-based auth within SvelteKit and other JS projects. You can add code which follows the Lucia guide to your project with `npx sv create` when creating a new project or `npx sv add lucia` for an existing project.\n\nAn auth system is tightly coupled to a web framework because most of the code lies in validating user input, handling errors, and directing users to the appropriate next page. As a result, many of the generic JS auth libraries include one or more web frameworks within them. For this reason, many users will find it preferrable to follow a SvelteKit-specific guide such as the examples found in [Lucia](https://lucia-auth.com/) rather than having multiple web frameworks inside their project.\n","## Sessions vs Tokens\n\n**Session IDs**: Stored in database, can be immediately revoked, but require a database query on each request.\n\n**JWT**: Not checked against datastore, cannot be immediately revoked, but offer improved latency and reduced datastore load.\n\n## Implementation in SvelteKit\n\nAuth cookies can be checked inside server hooks. When a user matches provided credentials, store user information in `locals` via server hooks.\n\n## Framework-Specific Approach\n\nUse framework-specific auth libraries like Lucia rather than generic JS auth libraries, since auth is tightly coupled to the web framework. Most auth code involves validating user input, handling errors, and routing users appropriately. Lucia provides session-based auth examples and can be added via `npx sv add lucia` to existing projects.","**Sessions vs JWT**: Sessions are revocable but require DB queries; JWT offer better latency but can't be revoked.\n\n**SvelteKit Integration**: Check auth cookies in server hooks, store user info in `locals`.\n\n**Use framework-specific libraries** like Lucia for auth implementation.","Authentication and authorization strategies in SvelteKit: comparing sessions vs tokens, integration via server hooks, and using framework-specific libraries."],"uses":{"params":["name","path"]}}]}
